<?php
$user =[
    ["talal","22","karachi","talal@example.com"],
    ["hamza","24","lahore","hamza@example.com"],
    ["maaz","21","islamabad","moiz@example"],  
    ["ali","23","peshawar","ali@example.com"],
];

//  echo "<pre>";
//  print_r($user);
//  echo "</pre>";


// echo $user [0][0] . "────୨ৎ────" .$user [0][1]. "────୨ৎ────" .$user [0][2]. "────୨ৎ────" .$user [0][3]. "<br>";
// echo $user [1][0] . "────୨ৎ────" .$user [1][1]. "────୨ৎ────" .$user [1][2]. "────୨ৎ────" .$user [1][3]. "<br>";
// echo $user [2][0] . "────୨ৎ────" .$user [2][1]. "────୨ৎ────" .$user [2][2]. "────୨ৎ────" .$user [2][3]. "<br>";

foreach ($user as $x){
    echo $x [0] . "────୨ৎ────" .$x [1]. "────୨ৎ────" .$x [2]. "────୨ৎ────" .$x [3]. "<br>";
}

?>